Copyright Jana Schaich Borg/Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)

# How to Meet and Retrieve Your Data

Watershed's intern put together a couple of sources of information that will be useful for your project. These three types of information are contained in the capstone database:
1. the current monthly rent Watershed charges for all of their client’s 244 properties, as well as the property type and geographic location of those properties. 
2. some general information about examples of short-term rental properties.  This information can be used to get a sense of what kind of nightly rental price Watershed’s client’s properties *could* be listed for, if they were converted to short-term rentals.
3. records about when those short-term rental properties were rented out, so that you can calculate their occupancy rates.

Your job is to determine how the database is organized so that you can retrieve all of the available information about Watershed’s client’s 244 properties, as well as the corresponding short-term rental information for comparable properties in the same location and of the same type.
1. Start by determining what tables the database contains, and what fields are included in each table.  
2. Then, we recommend that you make at least a rough relational schema of how the database is organized, so that you know what fields you can use to join tables. 
3. Next, make a list of the columns of data you want to retrieve in your final output.  
4. Finally, write your query to retrieve the desired data from the database.

Here are some hints about how to write your query:
* Start by joining no more than two tables.  After you have made sure the query works as written and that the output makes sense, add other tables one at a time, checking the new query and its results each time.
* Your final output should have 244 rows.  Given the limited output, the easiest way to extract the results will be to copy and paste the output from your query into Excel, although you could also extract as a .csv file and open that with Excel.  If you choose the .csv option, you might find it necessary to write your query on multiple lines when you declare it as a variable.  To do this, type a space (if you forget the space the lines will run together) and a "\" at the end of each line of your query:

```
my_data= %sql SELECT DISTINCT user_guid, state, membership_type \
FROM users \
WHERE country="US" AND state IS NOT NULL and membership_type IS NOT NULL \
ORDER BY state ASC, membership_type ASC ;

my_data.csv('my_data.csv')
```

* We recommend that you calculate the occupancy rates of the example short-term rental properties within MySQL, rather than within Excel (it will be much faster!)  To do this, only examine rental dates during 2015, and remember that there are 365 days in the year.  The final output of your calculation should be the percentage of days in 2015 that the property was occupied.  You may want to consider using a subquery for this calculation.
* Make sure that you extract information from short-term rentals <u>**_that have the same location and property type_**</u> as the 244 Watershed properties.
* If you run into trouble, use your workbooks and Teradata notes from “Managing Big Data with MySQL” to remind you how to implement different parts of your query.

<img src="https://duke.box.com/shared/static/svbdzasxe7nncnszps6ewnkr8og4798c.jpg" width="300" alt="SQL Master"/>

## Good luck and have fun!

To get started, connect to the capstone database and set the database as your default database using the following commands:

```python
%load_ext sql
%sql mysql://studentuser:studentpw@localhost/capstone 
%sql USE capstone
```

### Load and connect to the database

In [1]:
!pip install pandas
!pip install mysql-connector-python
#!pip install pyodbc
import pandas as pd
import mysql.connector
#import pyodbc

Requirement already satisfied: pandas in /opt/conda/lib/python3.7/site-packages (1.3.4)
Requirement already satisfied: pytz>=2017.3 in /opt/conda/lib/python3.7/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10" in /opt/conda/lib/python3.7/site-packages (from pandas) (1.21.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /opt/conda/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Requirement already satisfied: mysql-connector-python in /opt/conda/lib/python3.7/site-packages (8.0.27)
Requirement already satisfied: protobuf>=3.0.0 in /opt/conda/lib/python3.7/site-packages (from mysql-connector-python) (3.19.1)

In [2]:
%load_ext sql
%sql mysql://studentuser:studentpw@localhost/capstone 
%sql USE capstone

 * mysql://studentuser:***@localhost/capstone
0 rows affected.

[]

In [3]:
#Create a connection

mydb = mysql.connector.connect(
  host="localhost",
  user="studentuser",
  passwd="studentpw",
  database="capstone"
)

In [4]:
# my_data= %sql SELECT DISTINCT user_guid, state, membership_type \
#               FROM users

### Queries

You can add as many "cells" as you need in order to explore the database and extract the appropriate data.  For a reminder about what "cells" are, how to add them, or how to use Jupyter in general, please refer to the "How to Use Jupyter Notebooks" video at: https://www.coursera.org/learn/analytics-mysql/lecture/oxkUg/how-to-use-jupyter-notebooks.

In [5]:
df = pd.read_sql_query('SHOW TABLES', mydb)
df

        Tables_in_capstone
0                 location
1            property_type
2         st_property_info
3          st_rental_dates
4         st_rental_prices
5  watershed_property_info

In [6]:
pd.read_sql_query('SHOW columns FROM property_type', mydb)

              Field          Type Null  Key Default Extra
0  property_type_id  varchar(255)   NO  PRI    None
1         apt_house  varchar(255)  YES         None
2      num_bedrooms  varchar(255)  YES         None
3           kitchen  varchar(255)  YES         None
4            shared  varchar(255)  YES         None

In [7]:
pd.read_sql_query('SELECT w.ws_property_id, w.current_monthly_rent, w.property_type, p.apt_house, p.num_bedrooms, p.kitchen, p.shared, w.location,\
                   l.city, l.state, l.zipcode\
                   FROM watershed_property_info w, property_type p, location l\
                   WHERE w.property_type=p.property_type_id \
                   AND w.location=l.location_id \
                   LIMIT 20;'
                   , mydb)

,ws_property_id,current_monthly_rent,property_type,apt_house,num_bedrooms,kitchen,shared,location,city,state,zipcode
0,W1,1060,R6,apartment,2,Y,N,L9531,Chapel Hill,NC,27514
1,W10,1200,R6,apartment,2,Y,N,L9533,Chapel Hill,NC,27517
2,W100,3300,R2,apartment,1,Y,N,L1944,San Francisco,CA,94129
3,W101,1400,R2,apartment,1,Y,N,L15257,Austin,TX,78702
4,W102,2000,R6,apartment,2,Y,N,L15257,Austin,TX,78702
5,W103,1600,R10,house,1,Y,N,L15257,Austin,TX,78702
6,W104,2800,R14,house,2,Y,N,L15257,Austin,TX,78702
7,W105,1100,R2,apartment,1,Y,N,L15260,Austin,TX,78705
8,W106,1900,R6,apartment,2,Y,N,L15260,Austin,TX,78705
9,W107,1800,R10,house,1,Y,N,L15260,Austin,TX,78705
10,W108,3200,R14,house,2,Y,N,L15260,Austin,TX,78705
11,W109,1000,R2,apartment,1,Y,N,L15264,Austin,TX,78723
12,W11,1000,R10,house,1,Y,N,L9533,Chapel Hill,NC,27517
13,W110,1300,R6,apartment,2,Y,N,L15264,Austin,TX,78723
14,W111,1200,R10,house,1,Y,N,L15264,Austin,TX,78723
15,W112,1600,R14,house,2,Y,N,L15264,Austin,TX,78723
16,W113,800,R2,apartment,1,Y,N,L15278,Austin,TX,78744
17,W114,1200,R6,apartment,2,Y,N,L15278,Austin,TX,78744
18,W115,900,R10,house,1,Y,N,L15278,Austin,TX,78744
19,W116,1100,R14,house,2,Y,N,L15278,Austin,TX,78744

In [8]:
pd.read_sql_query('SELECT DISTINCT w.ws_property_id,w.location, w.property_type,srd.st_property,(COUNT(DISTINCT srd.rental_date)/365)*100 \
                   AS occupancy_percentage, srp.sample_nightly_rent_price\
                   FROM watershed_property_info w JOIN st_property_info spi ON (w.location=spi.location AND w.property_type=spi.property_type)\
                   JOIN st_rental_prices srp \
                   ON (spi.location=srp.location AND spi.property_type=srp.property_type)\
                   JOIN st_rental_dates srd ON spi.st_property_id = srd.st_property\
                   WHERE YEAR(srd.rental_date)="2015" AND w.ws_property_id="W24"\
                   GROUP BY w.ws_property_id,w.location, w.property_type,srd.st_property', mydb)

,ws_property_id,location,property_type,st_property,occupancy_percentage,sample_nightly_rent_price
0,W24,L4765,R2,ST424,67.6712,239

In [9]:
pd.read_sql_query('COUNTIF(I2:I245,"Y")', mydb)

DatabaseError: Execution failed on sql 'COUNTIF(I2:I245,"Y")': 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'COUNTIF(I2:I245,"Y")' at line 1

In [10]:
## Code to combine fields from all six tables into one master table and export it to Excel
Capstone_data = %sql SELECT DISTINCT w.ws_property_id,w.location, w.property_type,w.current_monthly_rent,srp.percentile_10th_price,
srp.percentile_90th_price,srp.sample_nightly_rent_price,srd.rental_date,srd.st_property, 
COUNT(srd.rental_date)/365 AS occupancy_rate,p.apt_house,p.num_bedrooms,p.kitchen,p.shared,l.city,l.state,l.zipcode 
FROM watershed_property_info w JOIN st_property_info spi 
ON (w.location=spi.location AND w.property_type=spi.property_type) 
JOIN st_rental_prices srp 
ON (spi.location=srp.location 
AND spi.property_type=srp.property_type) 
JOIN property_type p 
ON w.property_type=p.property_type_id 
JOIN location l 
ON w.location=l.location_id 
JOIN st_rental_dates srd 
ON spi.st_property_id = srd.st_property 
WHERE YEAR(srd.rental_date)=2015 
GROUP BY srd.st_property  

Capstone_data.csv('Capstone_data.csv')

SyntaxError: invalid syntax (<ipython-input-10-b3a3f54eafcb>, line 4)

### Create csv files

In [11]:
pd.read_sql_query('SHOW TABLES', mydb)

        Tables_in_capstone
0                 location
1            property_type
2         st_property_info
3          st_rental_dates
4         st_rental_prices
5  watershed_property_info

In [12]:
myloc = pd.read_sql_query('SELECT * FROM location', mydb)
myloc

      location_id        city state  zipcode
0              L1   Anchorage    AK    99501
1             L10   Anchorage    AK    99518
2            L100    Cherokee    AL    35616
3           L1000       Azusa    CA    91702
4          L10000  Winston-Sa    NC    27101
...           ...         ...   ...      ...
18213       L9995      Wilson    NC    27896
18214       L9996     Windsor    NC    27983
18215       L9997     Wingate    NC    28174
18216       L9998    Winnabow    NC    28479
18217       L9999  Winston-Sa    NC    27040

[18218 rows x 4 columns]

In [13]:
myloc.to_csv("location.csv",index=False)

In [14]:
prop = pd.read_sql_query('SELECT * FROM property_type', mydb)
prop

   property_type_id  apt_house num_bedrooms kitchen shared
0                R1  apartment            1       Y      Y
1               R10      house            1       Y      N
2               R11      house            1       N      Y
3               R12      house            1       N      N
4               R13      house            2       Y      Y
5               R14      house            2       Y      N
6               R15      house            2       N      Y
7               R16      house            2       N      N
8                R2  apartment            1       Y      N
9                R3  apartment            1       N      Y
10               R4  apartment            1       N      N
11               R5  apartment            2       Y      Y
12               R6  apartment            2       Y      N
13               R7  apartment            2       N      Y
14               R8  apartment            2       N      N
15               R9      house            1       Y      Y

In [15]:
prop.to_csv("propertytype.csv",index=False)

In [16]:
prop_info = pd.read_sql_query('SELECT * FROM st_property_info', mydb)
prop_info

    st_property_id location property_type
0              ST1    L9531            R6
1             ST10    L9533            R6
2            ST100    L1944            R2
3           ST1000    L5957            R1
4            ST101   L15257            R2
..             ...      ...           ...
994          ST995    L5458            R4
995          ST996   L10771            R4
996          ST997   L11671           R12
997          ST998   L17570            R1
998          ST999    L9573            R8

[999 rows x 3 columns]

In [17]:
prop_info.to_csv("propertyinfo.csv",index=False)

In [18]:
rentaldate = pd.read_sql_query('SELECT * FROM st_rental_dates', mydb)
rentaldate

       rental_date st_property
0       2014-01-31       ST100
1       2014-01-31       ST106
2       2014-01-31       ST107
3       2014-01-31       ST109
4       2014-01-31       ST113
...            ...         ...
223007  2015-12-31       ST995
223008  2015-12-31       ST996
223009  2015-12-31       ST997
223010  2015-12-31       ST998
223011  2015-12-31       ST999

[223012 rows x 2 columns]

In [19]:
rentaldate.to_csv("rentaldate.csv",index=False)

In [20]:
rentalprice = pd.read_sql_query('SELECT * FROM st_rental_prices', mydb)
rentalprice

,location,property_type,percentile_10th_price,percentile_90th_price,sample_nightly_rent_price
0,L10126,R1,83,273,192
1,L10126,R10,155,494,257
2,L10126,R11,82,411,242
3,L10126,R12,119,366,229
4,L10126,R13,137,416,375
...,...,...,...,...,...
971,L9534,R5,69,151,115
972,L9534,R6,111,147,123
973,L9534,R7,69,139,104
974,L9534,R8,101,199,163
975,L9534,R9,74,203,149

In [21]:
rentalprice.to_csv("rentalprice.csv",index=False)

In [22]:
watershed = pd.read_sql_query('SELECT * FROM watershed_property_info', mydb)
watershed

    ws_property_id location property_type  current_monthly_rent
0               W1    L9531            R6                  1060
1              W10    L9533            R6                  1200
2             W100    L1944            R2                  3300
3             W101   L15257            R2                  1400
4             W102   L15257            R6                  2000
..             ...      ...           ...                   ...
239            W95    L1943           R10                  4000
240            W96    L1943           R14                  5100
241            W97    L1944            R6                  5600
242            W98    L1944           R10                  5000
243            W99    L1944           R14                  6000

[244 rows x 4 columns]

In [23]:
watershed.to_csv("watershed.csv",index=False)